## Instantiate DataFrame, merge

#### Creating a DataFrame

In [99]:
import pandas as pd
import numpy as np


# create an instance and then set the columns
df= pd.DataFrame()
df['A'] = ['a','b','b']
df['B']= [1,2,3]
df['C']= [1.1,2.1,3.1]

df

   A  B    C
0  a  1  1.1
1  b  2  2.1
2  b  3  3.1

In [106]:
#  row 1 column B
df.loc[1]

A      b
B      2
C    2.1
Name: 1, dtype: object

In [104]:
df[["A","B"]]

   A  B
0  a  1
1  b  2
2  b  3

In [107]:
# create an instance by providing columns and values and index

df = pd.DataFrame([{'Name':'Chris','Item Purchased':'Sponge','Cost':22.50},
                  {'Name':'Kevyn','Item Purchased':'Kitty Litter', 'Cost':2.50},
                  {'Name':'Filip','Item Purchased':'Spoon', 'Cost':5.00}],
                 index = ['Store 1','Store 1','Store 2'])
df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0          Spoon  Filip

In [108]:
# add a new column to an existing dataframe, by providing a series of data

df['Date'] = ['December 1', 'January 1','mid-May']
df

         Cost Item Purchased   Name        Date
Store 1  22.5         Sponge  Chris  December 1
Store 1   2.5   Kitty Litter  Kevyn   January 1
Store 2   5.0          Spoon  Filip     mid-May

In [109]:
# add a new column and initialize it with the same value
df['Delivered'] = True
df

         Cost Item Purchased   Name        Date  Delivered
Store 1  22.5         Sponge  Chris  December 1       True
Store 1   2.5   Kitty Litter  Kevyn   January 1       True
Store 2   5.0          Spoon  Filip     mid-May       True

In [110]:
df['Feedback'] = ['Positive',None,'Negative']
df

         Cost Item Purchased   Name        Date  Delivered  Feedback
Store 1  22.5         Sponge  Chris  December 1       True  Positive
Store 1   2.5   Kitty Litter  Kevyn   January 1       True      None
Store 2   5.0          Spoon  Filip     mid-May       True  Negative

In [83]:
# reset the index of the DataFrame 

adf = df.reset_index()
adf['Date'] = pd.Series({0:'December 1',2:'mid-May'})
adf

     index  Cost Item Purchased   Name        Date  Delivered  Feedback
0  Store 1  22.5         Sponge  Chris  December 1       True  Positive
1  Store 1   2.5   Kitty Litter  Kevyn         NaN       True      None
2  Store 2   5.0          Spoon  Filip     mid-May       True  Negative

## Merging of DataFrame instances
This is similar concepts to Database joins, or algebra sets union and intersection. 
<br>An outer join is like a union
<br>an inner join is like an intersection

<svg height="100" width="100">
    <circle cx="50" cy="50" r="40" stroke="black" stroke-width="3" fill="red" />
</svg>

In [84]:
%%HTML
<svg width="800" height="300">
<!--  <circle cx="150" cy="180" r="80" fill-opacity="0.2" stroke="black" stroke-width="2" fill="blue" /> -->
  <circle cx="200" cy="100" r="80" fill-opacity="0.2" stroke="black" stroke-width="2" fill="red" />
  <circle cx="100" cy="100" r="80" fill-opacity="0.2" stroke="black" stroke-width="2" fill="green" />
  <line x1="150" y1="125" x2="300" y2="150" stroke="black" stroke-width="2" fill="black" stroke-dasharray="5,3"/>
  <text  x="300" y="165" font-family="Verdana" font-size="35">Intersection!</text>
</svg>

In [111]:
staff_df = pd.DataFrame([{'Name':'Kelly','Role':'Director of HR'},
                        {'Name':'Sally','Role':'Course liaison'},
                        {'Name':'James','Role':'Grader'}])
staff_df = staff_df.set_index('Name')
staff_df

                 Role
Name
Kelly  Director of HR
Sally  Course liaison
James          Grader

In [112]:

student_df = pd.DataFrame([{'Name': 'James', 'School':'Business'},
                          {'Name': 'Mike', 'School':'Law'},
                          {'Name': 'Sally', 'School':'Engineering'}])
student_df =student_df.set_index('Name')

student_df

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [87]:
# merging = outer, and using the index as the value to join on
# outer merger = union
pd.merge(staff_df,student_df,how='outer',left_index=True,right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liaison  Engineering

In [88]:
# same as above but an inner join = an intersection
pd.merge(staff_df,student_df,how='inner',left_index=True,right_index=True)

                 Role       School
Name
Sally  Course liaison  Engineering
James          Grader     Business

In [89]:
# merge left
pd.merge(staff_df,student_df,how='left',left_index=True,right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liaison  Engineering
James          Grader     Business

In [90]:
# merge right
pd.merge(staff_df,student_df,how='right',left_index=True,right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liaison  Engineering

In [91]:
# removing the index and merging on specific column
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liaison  Engineering
2  James          Grader     Business

In [92]:
# if you have the same column in both DataFrame, the result will rename the columns adding _y and _x (this can be changed)
staff_df = pd.DataFrame([{'Name':'Kelly','Role':'Director of HR', 'Location':'State Street'},
                        {'Name':'Sally','Role':'Course liaison', 'Location':'Washington Avenue'},
                        {'Name':'James','Role':'Grader', 'Location':'Washington Avenue'}])
                         
student_df = pd.DataFrame([{'Name': 'James', 'School':'Business', 'Location':'1024 Billiard Avenue'},
                          {'Name': 'Mike', 'School':'Law', 'Location':'Fraternity House #22'},
                          {'Name': 'Sally', 'School':'Engineering', 'Location':'512 Wilson Crescent'}])

pd.merge(staff_df, student_df, how='left',left_on='Name',right_on='Name')

          Location_x   Name            Role            Location_y       School
0       State Street  Kelly  Director of HR                   NaN          NaN
1  Washington Avenue  Sally  Course liaison   512 Wilson Crescent  Engineering
2  Washington Avenue  James          Grader  1024 Billiard Avenue     Business

In [93]:
pd.merge(staff_df, student_df, how='left',left_on='Name',right_on='Name',suffixes=['_staff','_student'])

      Location_staff   Name            Role      Location_student       School
0       State Street  Kelly  Director of HR                   NaN          NaN
1  Washington Avenue  Sally  Course liaison   512 Wilson Crescent  Engineering
2  Washington Avenue  James          Grader  1024 Billiard Avenue     Business

In [94]:
# you can use multiple columns to merge on, in this case we use "First Name" and "Last Name"
staff_df1 = pd.DataFrame([{'First Name':'Kelly','Last Name':'Desjardins','Role':'Director of HR'},
                        {'First Name':'Sally','Last Name':'Brooks','Role':'Course liaison'},
                        {'First Name':'James','Last Name':'Wilde','Role':'Grader'}])

student_df1 = pd.DataFrame([{'First Name': 'James','Last Name':'Hammond', 'School':'Business'},
                          {'First Name': 'Mike','Last Name':'Smith', 'School':'Law'},
                          {'First Name': 'Sally','Last Name':'Brooks', 'School':'Engineering'}])
print(staff_df1)
print(student_df1)
print(pd.merge(staff_df1, student_df1, how='inner', left_on=['First Name', 'Last Name'], right_on=['First Name','Last Name']))

  First Name   Last Name            Role
0      Kelly  Desjardins  Director of HR
1      Sally      Brooks  Course liaison
2      James       Wilde          Grader
  First Name Last Name       School
0      James   Hammond     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering
  First Name Last Name            Role       School
0      Sally    Brooks  Course liaison  Engineering

#### How to merge if you have one DataFrame with an index and merging on a column of the other DataFrame

In [95]:
stf_df = staff_df.set_index("Name")
stf_df

                Location            Role
Name
Kelly       State Street  Director of HR
Sally  Washington Avenue  Course liaison
James  Washington Avenue          Grader

In [96]:
std_df = student_df.reset_index()
std_df

   index              Location   Name       School
0      0  1024 Billiard Avenue  James     Business
1      1  Fraternity House #22   Mike          Law
2      2   512 Wilson Crescent  Sally  Engineering

In [98]:

pd.merge(stf_df, std_df, how='inner',left_index= True,right_on='Name',suffixes=['_staff','_student'])

,Location_staff,Role,index,Location_student,Name,School
2,Washington Avenue,Course liaison,2,512 Wilson Crescent,Sally,Engineering
0,Washington Avenue,Grader,0,1024 Billiard Avenue,James,Business